// var emojis  = [
//     {
//         "name": "happy",
//         "emoji": "😊",
//     },
//     {
//         "name": "sad",
//         "emoji": "😔"
//     },
//     {
//         "name": "sleep",
//         "emoji": "😴"
//     },
//     {
//         "name": "meh",
//         "emoji": "😐"
//     },
//     {
//         "name": "anxious",
//         "emoji": "😰"
//     },
//     {
//         "name": "angry",
//         "emoji": "😠"
//     },
//     {
//         "name": "confused",
//         "emoji": "😕"
//     },
// ]

var emojis  = [
    {
        "date": "14",
        "day": "Tuesday",
        "emotions": "😊😊😊😊😊😴😴😴😕😕😕😕😴😴😴😐😔😔😔😐😐😐😊😊"
    },

    {
        "date": "15",
        "day": "Wednesday",
        "emotions": "😊😊😊😊😊😊😴😴😴😴😴😴😴😴😐😐😐😐😔😔😰😰😐😐"
    },
    {
        "date": "16",
        "day": "Thursday",
        "emotions": "😐😐😐😊😊😊😴😴😴😊😊😕😕😴😴😰😰😠😠😰😰😔😔😊"
    },
    
    {
        "date": "17",
        "day": "Friday",
        "emotions": "😊😊😊😊😊😊😊😴😴😴😴😴😴😴😴😐😐😰😕😕😠😔😔😐"
    },

    {
        "date": "18",
        "day": "Saturday",
        "emotions": "😐😐😊😊😊😊😊😴😴😴😴😴😴😴😴😐😐😊😔😔😔😐😐😐"
    },
    {
        "date": "19",
        "day": "Sunday",
        "emotions": "😐😐😐😐😐😊😊😴😴😴😴😴😴😴😴😰😰😰😐😐😐😐😔😔"
    },
    {
        "date": "20",
        "day": "Monday",
        "emotions": "😔😔😔😰😰😰😰😴😴😴😴😴😴😴😐😐😐😰😰😰😕😕😕😊"
    },
    {
        "date": "April 21",
        "day": "Tuesday",
        "emotions": "😊😊😊😊😊😊😊😴😴😴😴😴😴😴😴😰😔😔😐😐😐😐😐😐"
    },
    {
        "date": "April 22",
        "day": "Wednesday",
        "emotions": "😐😐😐😐😊😊😴😴😴😴😴😴😴😴😔😔😰😰😕😕😕😕😕😕"
    },
    {
        "date": "April 23",
        "day": "Thursday",
        "emotions": "😕😕😊😊😊😕😕😕😕😕"
    }
]

// emojis.forEach(function(emoji) {
//     $('#emotions').append("<div class='emoji'>" + emojis.emotions + "</div>")
// })

